Repository: shseooo/DayFlow
Catalog: DayFlow/Localizable.xcstrings
Source language: ko
Languages: en, ja, zh_hans

# menu.summarize_now
source: 지금 요약
en: Summarize Now
ja: 今すぐ要約
zh_hans: 立即摘要

# menu.cancel_summary
source: 요약 취소
en: Cancel Summary
ja: 要約をキャンセル
zh_hans: 取消摘要

# menu.open_today_worklog
source: 오늘 워크로그 열기
en: Open Today's Worklog
ja: 今日のワークログを開く
zh_hans: 打开今天的工作日志

# menu.settings
source: 설정
en: Settings
ja: 設定
zh_hans: 设置

# menu.quit
source: 종료
en: Quit
ja: 終了
zh_hans: 退出

# settings.ai
source: AI 설정
en: AI Settings
ja: AI 設定
zh_hans: AI 设置

# settings.provider
source: 제공자
en: Provider
ja: プロバイダ
zh_hans: 提供商

# settings.endpoint
source: API 엔드포인트
en: API Endpoint
ja: API エンドポイント
zh_hans: API 终结点

# settings.api_key
source: API 키
en: API Key
ja: API キー
zh_hans: API 密钥

# settings.model
source: 모델
en: Model
ja: モデル
zh_hans: 模型

# settings.ui_language
source: UI 언어
en: UI Language
ja: UI 言語
zh_hans: 界面语言

# settings.ui_language_footer
source: 메뉴바와 설정창의 표시 언어. "System Default"는 macOS 언어 설정을 따릅니다.
en: Language for the menu bar and settings window. "System Default" follows the macOS language.
ja: メニューバーと設定画面の表示言語。"System Default" は macOS の言語設定に従います。
zh_hans: 菜单栏和设置窗口的显示语言。"System Default" 跟随 macOS 系统语言。

# settings.summary_language
source: AI 요약 언어
en: AI Summary Language
ja: AI 要約言語
zh_hans: AI 摘要语言

# settings.summary_language_picker
source: 요약 출력 언어
en: Summary Output Language
ja: 要約出力言語
zh_hans: 摘要输出语言

# settings.summary_language_footer
source: AI가 생성하는 요약문의 언어. UI 언어와 독립.
en: Language of AI-generated summaries. Independent of UI language.
ja: AI が生成する要約の言語。UI 言語とは独立。
zh_hans: AI 生成摘要的语言,与界面语言独立。

# settings.output_path
source: 출력 경로
en: Output Path
ja: 出力パス
zh_hans: 输出路径

# settings.browse
source: 찾기
en: Browse
ja: 参照
zh_hans: 浏览

# settings.watched_dirs
source: 파일 변경 감시 디렉토리
en: Watched Directories
ja: 監視ディレクトリ
zh_hans: 监视目录

# settings.watched_dirs_footer
source: 지정된 디렉토리의 파일 생성/수정/이동/삭제를 실시간으로 기록합니다.
en: Records file create/modify/rename/delete events in the listed directories in real time.
ja: 指定ディレクトリのファイル作成/変更/移動/削除をリアルタイムで記録します。
zh_hans: 实时记录所列目录的文件创建/修改/重命名/删除事件。

# settings.add_dir
source: 디렉토리 추가
en: Add Directory
ja: ディレクトリを追加
zh_hans: 添加目录

# settings.excluded_dirs
source: 변경 감시 제외 디렉토리
en: Excluded Directories
ja: 監視除外ディレクトリ
zh_hans: 排除目录

# settings.excluded_dirs_footer
source: 경로의 일부가 이 목록에 매칭되면 변경 이벤트를 기록하지 않습니다. 예: minio 데이터 폴더, 임시 작업 폴더 등.
en: Skips change events for paths whose substring matches any item here. e.g. minio data folder, temp build folder.
ja: パスの一部がここに一致する場合、変更イベントを記録しません。例: minio データフォルダ、一時作業フォルダ。
zh_hans: 如果路径包含此列表中的任一项,则跳过对应的变更事件。例如 minio 数据文件夹、临时工作目录。

# settings.add_excluded_dir
source: 제외 디렉토리 추가
en: Add Excluded Directory
ja: 除外ディレクトリを追加
zh_hans: 添加排除目录

# settings.zsh_realtime
source: 터미널 실시간 수집 (zsh)
en: Terminal Real-time Collection (zsh)
ja: ターミナル リアルタイム収集 (zsh)
zh_hans: 终端实时收集 (zsh)

# settings.zsh_explanation
source: zsh는 기본적으로 셸 종료 시점에만 history 파일에 기록합니다. 명령 실행 직후 실시간으로 수집하려면 ~/.zshrc 끝에 아래 옵션을 추가하세요.
en: zsh writes to its history file only when the shell exits by default. To capture commands in real time, add the following options to the end of ~/.zshrc.
ja: zsh はデフォルトでシェル終了時のみ履歴ファイルへ書き込みます。実行直後にリアルタイムで収集するには、~/.zshrc の末尾に以下を追加してください。
zh_hans: zsh 默认仅在 shell 退出时写入历史文件。要在命令执行后立即捕获,请在 ~/.zshrc 末尾添加以下选项。

# settings.zsh_apply_hint
source: 적용 후 새 터미널을 열거나 `source ~/.zshrc`를 실행하세요.
en: Open a new terminal or run `source ~/.zshrc` to apply.
ja: 適用するには新しいターミナルを開くか、`source ~/.zshrc` を実行してください。
zh_hans: 应用方式: 打开新终端或运行 `source ~/.zshrc`。

# settings.launch_at_login
source: 로그인 시 자동 실행
en: Launch at Login
ja: ログイン時に自動起動
zh_hans: 登录时自动启动

# settings.autostart_section
source: 자동 시작
en: Auto-Start
ja: 自動起動
zh_hans: 自动启动

# settings.autostart_footer
source: macOS 로그인 시 DayFlow를 자동으로 실행합니다. 첫 등록 후 시스템 설정 → 일반 → 로그인 항목에서 승인이 필요할 수 있습니다.
en: Launches DayFlow automatically at macOS login. After first registration, approval may be required in System Settings → General → Login Items.
ja: macOS ログイン時に DayFlow を自動起動します。初回登録後、システム設定 → 一般 → ログイン項目で承認が必要な場合があります。
zh_hans: 在 macOS 登录时自动启动 DayFlow。首次注册后,可能需要在系统设置 → 通用 → 登录项中批准。

# settings.current_status
source: 현재 상태: %@
en: Current status: %@
ja: 現在のステータス: %@
zh_hans: 当前状态: %@

# settings.open_system_settings
source: 시스템 설정 열기
en: Open System Settings
ja: システム設定を開く
zh_hans: 打开系统设置

# settings.unstable_location_warning
source: ⚠ 현재 앱이 Xcode DerivedData 또는 임시 폴더에서 실행 중입니다. /Applications로 옮긴 후 등록해야 부팅 시 정상 실행됩니다.
en: ⚠ The app is running from Xcode DerivedData or a temporary folder. Move it to /Applications before registering for login startup.
ja: ⚠ アプリは Xcode DerivedData または一時フォルダから実行中です。起動時の自動実行を有効にする前に /Applications へ移動してください。
zh_hans: ⚠ 应用正在从 Xcode DerivedData 或临时文件夹运行。请先移动到 /Applications 再注册开机自启动。

# settings.permissions
source: 권한 상태
en: Permissions
ja: 権限
zh_hans: 权限

# settings.permission.accessibility
source: 접근성 권한
en: Accessibility
ja: アクセシビリティ
zh_hans: 辅助功能

# settings.permission.full_disk
source: 전체 디스크 접근
en: Full Disk Access
ja: フルディスクアクセス
zh_hans: 完全磁盘访问

# settings.permission.open
source: 설정 열기
en: Open Settings
ja: 設定を開く
zh_hans: 打开设置

# settings.permission_footer
source: 권한 변경 후 잠시 기다리거나 앱을 재시작하면 자동으로 반영됩니다.
en: Permission changes apply after a short wait or app restart.
ja: 権限の変更は少し待つかアプリを再起動すれば自動で反映されます。
zh_hans: 权限变更稍后自动生效,或重启应用。

# settings.autosaved
source: 자동 저장됨
en: Auto-saved
ja: 自動保存済み
zh_hans: 已自动保存

# settings.register_failed
source: 등록 실패: %@
en: Registration failed: %@
ja: 登録失敗: %@
zh_hans: 注册失败: %@

# launch.status.enabled
source: 활성
en: Enabled
ja: 有効
zh_hans: 已启用

# launch.status.requires_approval
source: 승인 대기
en: Requires Approval
ja: 承認待ち
zh_hans: 等待批准

# launch.status.not_registered
source: 등록 안 됨
en: Not Registered
ja: 未登録
zh_hans: 未注册

# launch.status.not_found
source: 차단됨
en: Blocked
ja: ブロック済み
zh_hans: 已阻止

# status.idle
source: 매시간 0분에 자동 요약
en: Auto-summary at the top of every hour
ja: 毎時 00 分に自動要約
zh_hans: 每小时整点自动摘要

# status.cancelled
source: 요약 취소됨
en: Summary cancelled
ja: 要約をキャンセルしました
zh_hans: 已取消摘要

# status.already_running
source: 요약이 이미 진행 중입니다
en: Summary already in progress
ja: 要約はすでに実行中です
zh_hans: 摘要正在进行中

# status.no_activity
source: 활동 없음 (건너뜀)
en: No activity (skipped)
ja: アクティビティなし (スキップ)
zh_hans: 无活动(已跳过)

# status.generating
source: %@ 생성 중...
en: Generating %@...
ja: %@ を生成中...
zh_hans: 正在生成 %@...

# status.completed
source: %1$@ 완료 (%2$@)
en: %1$@ completed (%2$@)
ja: %1$@ 完了 (%2$@)
zh_hans: %1$@ 完成 (%2$@)

# status.failed
source: %1$@ 실패: %2$@
en: %1$@ failed: %2$@
ja: %1$@ 失敗: %2$@
zh_hans: %1$@ 失败: %2$@

# status.slot_progress
source: %1$@ 슬롯 %2$d/%3$d (%4$@) 생성 중...
en: %1$@ slot %2$d/%3$d (%4$@)...
ja: %1$@ スロット %2$d/%3$d (%4$@) を生成中...
zh_hans: %1$@ 时段 %2$d/%3$d (%4$@) 生成中...

# mode.hourly
source: 매시간 요약
en: Hourly summary
ja: 毎時要約
zh_hans: 每小时摘要

# mode.manual
source: 수동 요약
en: Manual summary
ja: 手動要約
zh_hans: 手动摘要

# alert.permissions_title
source: 권한이 필요합니다
en: Permissions required
ja: 権限が必要です
zh_hans: 需要授予权限

# alert.permissions_message
source: DayFlow가 작동하려면 전체 디스크 접근 권한과 접근성 권한이 필요합니다.
en: DayFlow needs Full Disk Access and Accessibility permissions to work.
ja: DayFlow が動作するにはフルディスクアクセスとアクセシビリティの権限が必要です。
zh_hans: DayFlow 需要完全磁盘访问和辅助功能权限才能正常工作。

# alert.open_settings
source: 설정 열기
en: Open Settings
ja: 設定を開く
zh_hans: 打开设置

# alert.cancel
source: 취소
en: Cancel
ja: キャンセル
zh_hans: 取消

# window.settings_title
source: DayFlow 설정
en: DayFlow Settings
ja: DayFlow 設定
zh_hans: DayFlow 设置
